# taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'

brew 'coreutils'
brew 'git'
brew 'tree'
brew 'ag'
brew 'zsh'
brew 'zsh-completions'
brew 'autoconf'
brew 'libzip'
brew 'pkg-config'
brew 'tldr'
brew 'docker'
brew 'ncurses'
brew 'pyenv'
brew 'xz'
brew 'gdbm'
brew 'openssl'
brew 'python'
brew 'gettext'
brew 'pcre'
brew 'readline'
brew 'pcre2'
brew 'sqlite'
brew 'hyper'
brew 'pipenv'
brew 'the_silver_searcher'
brew 'tree'

# apps
cask 'alfred'
cask 'docker'
cask 'google-chrome'
cask 'slack'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extenstion-pack'

# quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# fonts
cask 'font-source-code-pro-for'
cask 'font-source-code-pro-for-powerline'
