# frozen_string_literal: true

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'mas-cli/tap'
tap 'nektos/tap'
tap 'romkatv/powerlevel10k'
brew 'openssl@1.1'
brew 'ansible'
brew 'ansible-lint'
brew 'autoconf'
brew 'aws-iam-authenticator'
brew 'awscli'
brew 'bash'
brew 'gettext'
brew 'colordiff'
brew 'coreutils'
brew 'pkg-config'
brew 'gh'
brew 'git'
brew 'gitlab-runner'
brew 'gnu-sed'
brew 'graphviz'
brew 'grep'
brew 'helm'
brew 'jq'
brew 'kompose'
brew 'kubernetes-cli'
brew 'kubectx'
brew 'libzip'
brew 'mysql-client'
brew 'ncurses'
brew 'pipenv'
brew 'pre-commit'
brew 'pyenv'
brew 'rbenv'
brew 'shellcheck'
brew 'shfmt'
brew 'shyaml'
brew 'swig'
brew 'telnet'
brew 'tfenv'
brew 'the_silver_searcher'
brew 'tldr'
brew 'tree'
brew 'vagrant-completion'
brew 'watch'
brew 'wget'
brew 'yq'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'nektos/tap/act'
brew 'romkatv/powerlevel10k/powerlevel10k'
cask '1password'
cask '1password-cli'
cask 'alacritty'
cask 'alfred'
cask 'docker'
cask 'font-fira-code'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'hyper'
cask 'ngrok'
cask 'omnifocus'
cask 'vagrant'
cask 'visual-studio-code'
mas 'Bear', id: 1_091_189_122
mas 'Grammarly for Safari', id: 1_462_114_288
mas 'iMovie', id: 408_981_434
mas 'Keynote', id: 409_183_694
mas 'MindNode', id: 992_076_693
mas 'Numbers', id: 409_203_825
mas 'Pages', id: 409_201_541
mas 'Slack', id: 803_453_959
mas 'Spark', id: 1_176_895_641
mas 'Twitterrific', id: 1_289_378_661
