# taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'mas-cli/tap'

brew 'mas'
brew 'coreutils'
brew 'git'
brew 'tree'
brew 'ag'
brew 'gcc'
brew 'zsh'
brew 'zsh-completions'
brew 'autoconf'
brew 'libzip'
brew 'pkg-config'
brew 'tldr'
brew 'docker'
brew 'ncurses'
brew 'pyenv'
brew 'python'
brew 'pipenv'
brew 'the_silver_searcher'
brew 'jq'
brew 'hub'

# apps
cask '1password'
cask 'alfred'
cask 'docker'
cask 'google-chrome'
cask 'hyper'
cask 'slack'
cask 'vagrant'
cask 'visual-studio-code'
cask 'microsoft-teams'
cask 'omnifocus'
# cask 'virtualbox'
# cask 'virtualbox-extension-pack'
mas "Trello", id: 1278508951
mas "Bear", id: 1091189122
mas "Magnet", id: 441258766
mas "Twitterrific 5", id: 1289378661

# quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# fonts
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
